//이용약관 text 내용
// 길어서 여기에 따로 정리해두었음
// 안보이게 해야겠지..?? >> 나중에 env 파일로 수정하겠음!

export const termsData = {
    terms2: `
    이 이용약관(이하 "본 약관")은 오늘의 야구 (이하 "회사")가 제공하는 오늘의 야구-야구 모바일 애플리케이션 및 관련 서비스 (이하 "서비스")의 이용 조건을 정하는 것을 목적으로 합니다. 이 약관은 회사와 이용자 사이의 권리와 의무를 규정하며, 서비스 이용 시 준수해야 할 사항을 안내합니다.

    **1. 약관의 효력과 변경**
    1.1. 이 약관은 서비스를 이용하고자 하는 모든 사용자에게 적용됩니다.
    1.2. 회사는 필요한 경우 본 약관을 변경할 수 있습니다. 변경된 약관은 서비스 내 공지사항을 통해 공지됩니다. 변경된 약관은 공지 후 이용자에게 통지되며, 이 기간 내에 약관 변경에 대한 이의를 제기하지 않은 이용자는 변경된 약관에 동의한 것으로 간주됩니다.
    
    **2. 서비스 이용**
    2.1. 이용자는 서비스를 약관 및 관련 법률, 규정을 준수하여 사용해야 합니다.
    2.2. 서비스 내에서 무단으로 다른 이용자의 개인정보를 수집하거나 제3자의 권리를 침해하는 행위는 금지됩니다.
    2.3. 서비스 이용 중에 발생하는 모든 활동에 대한 책임은 이용자 본인에게 있습니다.
    
    **3. 개인정보 처리**
    3.1. 회사는 개인정보 보호 정책에 따라 이용자의 개인정보를 처리합니다. 자세한 내용은 회사의 개인정보 보호 정책을 확인하시기 바랍니다.
    
    **4. 책임과 면책**
    4.1. 회사는 서비스 제공과 관련하여 합리적인 주의를 기울이겠지만, 다음과 같은 상황에서 발생하는 손해에 대해 책임지지 않습니다.
    
    - 서비스 이용으로 인한 직접적인 또는 간접적인 손해
    - 서비스 내 정보의 정확성, 완전성, 신뢰성 등에 관한 손해
    4.2. 이용자가 서비스 이용으로 다른 이용자 또는 제3자에게 손해를 입힌 경우, 이용자는 해당 손해를 배상할 책임이 있습니다.
    
    **5. 계약의 해지**
    5.1. 이용자는 언제든지 본 약관 및 회사의 정책에 따라 서비스 이용 계약을 해지할 수 있습니다.
    5.2. 회사는 이용자가 본 약관 또는 관련 법률, 규정을 위반한 경우 이용 계약을 해지할 수 있습니다.
    
    **6. 지적재산권**
    6.1. 서비스 내에 포함된 콘텐츠 및 자료의 지적재산권은 회사에 소유권이 있습니다.
    6.2. 이용자는 회사의 사전 승인 없이 서비스 내 콘텐츠 및 자료를 무단으로 복제, 수정, 배포 등의 행위를 하여서는 안 됩니다.
    
    **7. 준거법 및 분쟁해결**
    7.1. 본 약관의 해석과 관련하여 발생하는 분쟁은 관련 법률에 따라 해결됩니다.
    7.2. 서비스 이용으로 발생하는 분쟁은 회사와 이용자 간의 협의를 통해 해결하려 노력해야 합니다.
    `,
    terms3: `
    이 개인정보 처리 방침(이하 "방침")은 오늘의 야구 (이하 "회사")가 제공하는 오늘의 야구-야구 모바일 애플리케이션 및 관련 서비스 (이하 "서비스")에서 이용자의 개인정보를 처리하는 방법과 그에 따른 권리와 의무를 규정하는 것을 목적으로 합니다. 이 방침은 회사와 이용자 사이의 권리와 의무를 규정하며, 개인정보 처리 시 준수해야 할 사항을 안내합니다.

    **1. 수집하는 개인정보의 항목 및 수집 방법**
    1.1. 회사는 서비스 제공을 위해 다음과 같은 개인정보를 수집할 수 있습니다.
    
    - 이메일 주소
    1.2. 개인정보는 서비스 이용 과정에서 사용자가 직접 제공하는 경우, 자동 수집된 정보, 제3자로부터 제공받는 경우 등 다양한 방법으로 수집될 수 있습니다.
    
    **2. 개인정보의 처리 목적**
    2.1. 회사는 개인정보를 다음과 같은 목적으로 처리합니다.
    
    - 가입한 사용자의 계정 관리 및 직관 기록 백업, 복구
    
    **3. 개인정보의 보유 및 이용 기간**
    3.1. 회사는 개인정보 보유 및 이용 기간을 명확히 지정하며, 해당 기간이 종료되거나 처리 목적이 달성되면 개인정보를 파기합니다.
    
    **4. 개인정보의 제3자 제공**
    4.1. 회사는 이용자의 개인정보를 제3자에게 제공하지 않습니다. 다만, 관련 법령에 따라 필요한 경우 이용자의 동의를 얻거나 법적 절차를 거쳐 제공할 수 있습니다.
    
    **5. 개인정보의 파기**
    5.1. 회사는 개인정보 처리 목적이 달성된 경우 즉시 개인정보를 파기합니다. 파기 방법은 안전한 방법으로 진행되며, 관련 법령 및 내부 방침에 따라 진행됩니다.
    
    **6. 이용자의 권리와 행사 방법**
    6.1. 이용자는 개인정보에 대한 열람, 정정, 삭제, 처리정지 요구 등의 권리를 행사할 수 있습니다. 권리 행사를 위해서는 회사의 고객 지원 채널을 이용하거나 별도의 절차를 따르셔야 합니다.
    
    **7. 개인정보의 안전성 확보 조치**
    7.1. 회사는 개인정보를 안전하게 처리하기 위해 기술적, 관리적, 물리적 조치를 취하고 있습니다.
    
    **8. 개인정보 처리 방침의 변경**
    8.1. 회사는 필요한 경우 개인정보 처리 방침을 변경할 수 있으며, 변경 사항은 서비스 내 공지사항을 통해 공지됩니다.
    
    **9. 문의처**
    9.1. 개인정보 처리와 관련하여 궁금한 사항이 있으면 @@@@ (이메일 생성) 로 문의하실 수 있습니다.
    `,
  };
  
export default termsData;